In [1]:
import pandas as pd
import statsmodels.api as sm
import scipy.stats as stats
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

**Question 1**

**Parameter:** Cutlets from Unit A & Unit B

**Parameter of Interest:** $\mu_1 - \mu_2$, diameter of the cutlet.

**Null Hypothesis:** $\mu_1 = \mu_2$ There is no significant differenece.

**Alternative Hypthosis:** $\mu_1 \neq \mu_2$

**Checking for Inequality**

In [3]:
cutlets=pd.read_csv('C:\\Users\\Krishnakant Baset\\OneDrive\\Desktop\\Data Science Material\\Assignments\\Krishnakant Baset Assignments\\Hypothesis Testing\\cutlets.csv')

In [4]:
cutlets.head()

   Unit A  Unit B
0  6.8090  6.7703
1  6.4376  7.5093
2  6.9157  6.7300
3  7.3012  6.7878
4  7.4488  7.1522

In [7]:
cutlets.mean()

Unit A    7.019091
Unit B    6.964297
dtype: float64

In [9]:
cutlets.describe()

          Unit A     Unit B
count  35.000000  35.000000
mean    7.019091   6.964297
std     0.288408   0.343401
min     6.437600   6.038000
25%     6.831500   6.753600
50%     6.943800   6.939900
75%     7.280550   7.195000
max     7.516900   7.545900

In [10]:
sm.stats.ztest(cutlets["Unit A"].dropna(), cutlets["Unit B"].dropna(), alternative='two-sided')

(0.7228688704678063, 0.46976045023906055)

**Conclusion**

As the p value (0.4697) is greater than $\alpha\$ = 0.05 , so we failed to reject our null that there is no significant difference in diamemeter of cutlets in Unit A and Unit B.

**Question 2**

**Parameter:** Reports of the laboratories

**Parameter of Interest:** Average TAT

**Null Hypothesis:** All samples TAT population means are same.

**Alternative Hypthosis:** tleast one sample TAT population mean is different

**Test  Annova**

In [11]:
LabTAT=pd.read_csv('C:\\Users\\Krishnakant Baset\\OneDrive\\Desktop\\Data Science Material\\Assignments\\Krishnakant Baset Assignments\\Hypothesis Testing\\labTAT.csv')

In [13]:
LabTAT.head()

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

In [14]:
LabTAT.describe()

       Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
count    120.000000    120.000000    120.000000     120.00000
mean     178.361583    178.902917    199.913250     163.68275
std       13.173594     14.957114     16.539033      15.08508
min      138.300000    140.550000    159.690000     124.06000
25%      170.335000    168.025000    188.232500     154.05000
50%      178.530000    178.870000    199.805000     164.42500
75%      186.535000    189.112500    211.332500     172.88250
max      216.390000    217.860000    238.700000     205.18000

In [15]:
stats.f_oneway(LabTAT['Laboratory 1'],LabTAT['Laboratory 2'],LabTAT['Laboratory 3'],LabTAT['Laboratory 4'])

F_onewayResult(statistic=118.70421654401437, pvalue=2.1156708949992414e-57)

**Conclusion:** As pvalue (2.1156e-57) is less than $\alpha\$ = 0.05 , so we reject the null hypothesis saying All samples TAT population means are same.

**Question 3**

**Null Hypothesis:** All Proportions are equal

**Alternative Hypothesis:** Not all proportions are equal

**Chi-Squared Test:Test of independence**

In [24]:
from scipy.stats import chi2_contingency

In [25]:
table=[(50,142,131,70),(550,351,480,350)]
table

[(50, 142, 131, 70), (550, 351, 480, 350)]

In [26]:
stat, p, dof, expected = chi2_contingency(table)
print('dof=%d' % dof)
print(p)

dof=3
2.682172557281901e-17

In [34]:
alpha=0.05
print('alpha=0.05')
print('p=', (p))
if p<=alpha:
    print('Reject Null Hypothesis saying all proportions are equal')
else:
    print('Failed to reject the null hypothesis saying all proportions are equal')

alpha=0.05
p= 2.682172557281901e-17
Reject Null Hypothesis saying all proportions are equal

**Question-4**

**Intrest:** % of the customer order forms

**Null Hypothesis:** Defective % varies by centre.

**Alternative Hypothesis:** Defective % does not varies by centre.

**Annova Test**

In [35]:
cof=pd.read_csv('C:\\Users\\Krishnakant Baset\\OneDrive\\Desktop\\Data Science Material\\Assignments\\Krishnakant Baset Assignments\\Hypothesis Testing\\customerorderform.csv')

In [36]:
cof.describe()

       Phillippines   Indonesia       Malta       India
count           300         300         300         300
unique            2           2           2           2
top      Error Free  Error Free  Error Free  Error Free
freq            271         267         269         280

In [37]:
cof.head()

  Phillippines   Indonesia       Malta       India
0   Error Free  Error Free   Defective  Error Free
1   Error Free  Error Free  Error Free   Defective
2   Error Free   Defective   Defective  Error Free
3   Error Free  Error Free  Error Free  Error Free
4   Error Free  Error Free   Defective  Error Free

In [38]:
from sklearn import preprocessing

In [42]:
from sklearn.preprocessing import LabelEncoder
labelencoder = LabelEncoder()

In [45]:
cof.iloc[:, 0] = labelencoder.fit_transform(cof.iloc[:, 0])
cof.iloc[:, 0]

0      1
1      1
2      1
3      1
4      1
      ..
295    1
296    1
297    1
298    1
299    1
Name: Phillippines, Length: 300, dtype: int64

In [46]:
cof.iloc[:, 1] = labelencoder.fit_transform(cof.iloc[:, 1])
cof.iloc[:, 1]

0      1
1      1
2      0
3      1
4      1
      ..
295    1
296    1
297    1
298    1
299    0
Name: Indonesia, Length: 300, dtype: int32

In [47]:
cof.iloc[:, 2] = labelencoder.fit_transform(cof.iloc[:, 2])
cof.iloc[:, 2]

0      0
1      1
2      0
3      1
4      0
      ..
295    1
296    1
297    0
298    1
299    0
Name: Malta, Length: 300, dtype: int32

In [48]:
cof.iloc[:, 3] = labelencoder.fit_transform(cof.iloc[:, 3])
cof.iloc[:, 3]

0      1
1      0
2      1
3      1
4      1
      ..
295    1
296    1
297    1
298    1
299    1
Name: India, Length: 300, dtype: int32

In [49]:
stats.f_oneway(cof.iloc[:, 0],cof.iloc[:, 1],cof.iloc[:, 2],cof.iloc[:, 3])

F_onewayResult(statistic=1.286168556089167, pvalue=0.2776780955705948)

**Conclusion**
As the p value (0.2778) is greater than  ùõº  = 0.05 , so we failed to reject our null that Defective % varies by centre.